% % hw3-p1-a
% x = [0, -7, 5]';
% x_ = [-0.2, -7.5, 5.4]';
% result1 = max(x - x_);
% A = [1, 2, 3; 2, 3, 4; 3, 4, 6];
% b = [1, -1, 2]';
% result2 = max(abs(A * x_ - b));

% % hw3-p1-b
% clear; clc;
% x = [0, -7, 5]';
% x_ = [-0.33, -7.9, 5.8]';
% result1 = max(x - x_);
% A = [1, 2, 3; 2, 3, 4; 3, 4, 6];
% b = [1, -1, 2]';
% result2 = max(abs(A * x_ - b));


% hw3-p2
% 定义出发，略


% % hw3-p3-a
% clear; clc;
% D = [0.03, 0; 0, -6.10];
% L = [0, 0; -5.31, 0];
% U = [0, -58.9; 0, 0];
% x = [0, 0];
% for i = 1: 10


% % hw3-p4-a
% clear; clc;
% D = [4, 0, 0; 0, 3, 0; 0, 0, 5];
% L = [0, 0, 0; 1, 0, 0; -2, -2, 0];
% U = [0, -1, 1; 0, 0, -1; 0, 0, 0];
% b = [5, -4, 1]';
% x = [0, 0, 0]';
% for k = 1:3
%     x = D \ (L + U) * x + D \ b;
%     fprintf('迭代%d次：x%d = [%.8f; %.8f; %.8f]\n', k, k, x(1), x(2), x(3));
% end

% % hw3-p4-b
% clear; clc;
% D = [-2, 0, 0; 0, -2, 0; 0, 0, 2];
% L = [0, 0, 0; -1, 0, 0; 0, -1, 0];
% U = [0, -1, -1/2; 0, 0, 1/2; 0, 0, 0];
% b = [4, -4, 0]';
% X = [0, 0, 0]';
% for k = 1:3
%     X = D \ (L + U) * X + D \ b;
%     fprintf('迭代%d次：X%d = [%.8f; %.8f; %.8f]\n', k, k, X(1), X(2), X(3));
% end


% % hw3-p5-a
% clear; clc;
% TOL = 0.001;
% D = [3, 0, 0; 0, 6, 0; 0, 0, 7];
% L = [0, 0, 0; -3, 0, 0; -3, -3, 0];
% U = [0, 1, -1; 0, 0, -2; 0, 0, 0];
% b = [1, 0, 4]';
% X = [0, 0, 0]';
% for k = 1:1000
%     X_new = (D - L) \ U * X + (D - L) \ b;
%     fprintf('迭代%d次：X%d = [%.8f; %.8f; %.8f]\n', k, k, X_new(1), X_new(2), X_new(3));
%     if norm(X_new - X, inf) < TOL
%         break;
%     else
%         X = X_new;
%     end
% end


% % hw3-p5-b
% clear; clc;
% TOL = 0.001;
% D = [10, 0, 0; 0, 10, 0; 0, 0, 10];
% L = [0, 0, 0; 1, 0, 0; 0, 2, 0];
% U = [0, 1, 0; 0, 0, 2; 0, 0, 0];
% b = [9, 7, 6]';
% X = [0, 0, 0]';
% for k = 1:1000
%     X_new = (D - L) \ U * X + (D - L) \ b;
%     fprintf('迭代%d次：X%d = [%.8f; %.8f; %.8f]\n', k, k, X_new(1), X_new(2), X_new(3));
%     if norm(X_new - X, inf) < TOL
%         break;
%     else
%         X = X_new;
%     end
% end


