#include<stdio.h>
int main ()
{
    int i,j;
    double x1,x2,x3;
    double a[3][4]={3.03,-12.1,14,-119,
                    -3.03,12.1,-7,120,
                    6.11,-14.2,21,-139};
    for (i=1;i<=2;i++)
    {
        double t =a[i][0]/a[0][0];
        for(j=0;j<=3;j++)
        {
            a[i][j]=a[i][j]-t*a[0][j];//用第一行消去第二行与第三行的第一列
        }
    }
    x3=a[1][3]/a[1][2];
    x2=(a[2][3]-x3*a[2][2])/a[2][1];
    x1=(a[0][3]-x3*a[0][2]-x2*a[0][1])/a[0][0];
    
    printf("%f %f %f ",x1,x2,x3);
}